WBTQ/NXPCUP/board/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORT1_8 (coord A1), P1_8/J9[32]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORT1_9 (coord B1), P1_9/J9[30]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORT0_1 (coord A16), P0_1/SWCLK/J23[4]/D16[5]/J22[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                          /* @} */

/*! @name PORT0_0 (coord A17), P0_0/SWDIO/J23[2]/D16[6]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                         /* @} */

/*! @name PORT0_2 (coord B16), P0_2/SWO/J23[6]/D16[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void);

/*! @name PORT1_2 (coord C4), P1_2/SJ4[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_BLUE_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLUE_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_BLUE_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_10 (coord B12), P0_10/SJ5[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_RED_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_RED_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_RED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_27 (coord E10), P0_27/SJ6[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO_PIN 27U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_GREEN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GREEN_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_GREEN_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#define ICR_IRQS_irqs0 0x00u /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 0 */
#define ICR_IRQS_irqs1 0x01u /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 1 */
#define PCR_IBE_ibe1 0x01u   /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT0_6 (coord C14), P0_6/J23[7]/SW3[3]/SW3[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_23 (coord B7), P0_23/SJ9[1]/SW2[3]/SW2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT0_26 (coord F10), P0_26/J2[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_GPIO_PIN 26U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_BUTTON_CLICK_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PCR_IBE_ibe0 0x00u        /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u        /*!<@brief Input Buffer Enable: Enables */
#define PORT5_PCR_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT0_10 (coord B12), P0_10/SJ5[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_RED_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_LED_RED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_6 (coord K2), M1_PWM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_M1_PWM_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_M1_PWM_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_M1_PWM_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT2_4 (coord K3), M2_PWM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_M2_PWM_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_M2_PWM_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_M2_PWM_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT1_21 (coord L5), P1_21/SJ3[1]/J1[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_M1_INA_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_M1_INA_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_M1_INA_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_M1_INA_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_M1_INA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_M1_INA_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_M1_INA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT3_20 (coord M17), P3_20/J6[6]/J1[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_M1_INB_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_M1_INB_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_M1_INB_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_M1_INB_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_M1_INB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_M1_INB_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_M1_INB_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT4_13 (coord T7), P4_13/SJ10[1]/SJ2[3]/J8[18]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_M2_INA_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_M2_INA_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_M2_INA_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_M2_INA_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_M2_INA_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_M2_INA_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_M2_INA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT3_16 (coord J15), P3_16/SJ11[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_M2_INB_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_M2_INB_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_M2_INB_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_M2_INB_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_M2_INB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_M2_INB_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_M2_INB_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT0_14 (coord E11), RC_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RC_1_RISE_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_RC_1_RISE_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_RC_1_RISE_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT0_15 (coord G13), RC_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RC_2_RISE_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_RC_2_RISE_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_RC_2_RISE_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT0_14 (coord E11), RC_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RC_1_FALL_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_RC_1_FALL_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_RC_1_FALL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT0_15 (coord G13), RC_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RC_2_FALL_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_RC_2_FALL_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_RC_2_FALL_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT3_19 (coord K17), P3_19/J5[1]/J1[13]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_SERVO_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_SERVO_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_SERVO_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT4_1 (coord P2), P4_1/J8[3]/SJ15[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PIXY_SCK_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_PIXY_SCK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_PIXY_SCK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_0 (coord P1), P4_0/J8[4]/SJ14[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PIXY_SDA_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_PIXY_SDA_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_PIXY_SDA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT5_4 (coord M12), P5_4/J2[7]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_VDCB_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_VDCB_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_VDCB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
